eisup_2019_docmng_integration/src/InformationRegisters/Работники/Работники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Работники</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <attributes>
    <name>УдалитьТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаУвольнения</name>
    <type>
      <types>CatalogRef.ОснованияУвольнения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ПлановыеНачисленияРаботников/ПлановыеНачисленияРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеНачисленияРаботников</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.УправленческиеНачисления</types>
    </type>
  </resources>
  <resources>
    <name>ВидРасчетаЗавершения</name>
    <type>
      <types>ChartOfCalculationTypesRef.УправленческиеНачисления</types>
    </type>
  </resources>
  <resources>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта1</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд1</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта2</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд2</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта3</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд3</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта4</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд4</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта5</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд5</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта6</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд6</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Действие</name>
    <type>
      <types>EnumRef.ВидыДействияСНачислением</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеЗавершения</name>
    <type>
      <types>EnumRef.ВидыДействияСНачислением</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель1Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель2Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель3Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель4Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель5Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель6Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта1Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта2Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта3Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта4Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта5Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта6Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд1Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд2Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд3Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд4Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд5Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд6Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчетаИзмерение</name>
    <type>
      <types>ChartOfCalculationTypesRef.УправленческиеНачисления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ПлановыеУдержанияРаботников/ПлановыеУдержанияРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеУдержанияРаботников</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта1</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Показатель2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта2</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Показатель3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта3</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Показатель4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта4</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Показатель5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта5</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Показатель6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта6</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Действие</name>
    <type>
      <types>EnumRef.ВидыДействияСНачислением</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеЗавершения</name>
    <type>
      <types>EnumRef.ВидыДействияСНачислением</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель1Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель2Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель3Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель4Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель5Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель6Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта1Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта2Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта3Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта4Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта5Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта6Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.УправленческиеУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВводСведенийОПлановыхНачисленияхУдержанияхРаботников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ТипыПоказателейСхемМотивации/ТипыПоказателейСхемМотивации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПоказателейСхемМотивации</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Денежный</name>
  </enumValues>
  <enumValues>
    <name>Числовой</name>
  </enumValues>
  <enumValues>
    <name>Процентный</name>
  </enumValues>
  <enumValues>
    <name>ОценочнаяШкалаЧисловая</name>
  </enumValues>
  <enumValues>
    <name>ОценочнаяШкалаПроцентная</name>
  </enumValues>
  <enumValues>
    <name>ТарифныйРазряд</name>
  </enumValues>
  <enumValues>
    <name>СуммаПоказателя</name>
  </enumValues>
  <enumValues>
    <name>Стаж</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/CommonModules/ЗаполнениеДокументовДополнительный/Module.bsl
// Процедура предназначена для получения начислений и действий с ними
// в зависимости от кадрового события.
//
// Параметры:
//  ДанныеДокумента					- исходные данные для выполнения запроса: ссылка на сотрудника, 
//									  если сотрудник один, таблица значений в случае, если их несколько
//  ДокументСсылка					- ссылка на документ
//  ДокументДата					- дата документа
//  Организация						- ссылка на организацию
//	ИмяДатыДействия					- в разных документах поле с датой действия 
//									  имеет разное имя: ДатаНачала, ДатаДействия, ДатаПриема
//	КоэффициентИндексацииЗаработка 	- необязательный, по умолчанию - 1 (нет индексации), 
//									  используется для пересчета значений при заполнении документа 
//									  Кадровое перемещение сотрудников организаций
//	ПоДаннымТрудовогоДоговора 		- необязательный, по умолчанию - Ложь, признак необходимости 
//									  получать данные трудового договора
//	ПолучатьПлановыеНачисления 		- необязательный, по умолчанию - Истина, признак необходимости 
//									  получать плановые начисления
//
Функция ПолучитьТаблицуДействийСУправленческимиНачислениями(ДанныеДокумента, ДокументСсылка, ДокументДата, ПолучатьПлановыеНачисления = Истина) Экспорт
	
	// некоторые поля в разных документах носят разные имена 
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		ПолеПодразделение 	= "Подразделение";
		ПолеДолжность 		= "Должность";
		ПолеДатаДействия 	= "ДатаПриема";
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КадровоеПеремещение") Тогда
		ПолеПодразделение 	= "НовоеПодразделение";
		ПолеДолжность 		= "НоваяДолжность";
		ПолеДатаДействия 	= "ДатаНачала";
	КонецЕсли;	
	
	// дополним таблицу данными шапки документа
	ДанныеДокумента.Колонки.Добавить("ДатаДокумента", 	ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ДанныеДокумента.ЗаполнитьЗначения(ДокументДата,		"ДатаДокумента");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ДанныеДокумента", ДанныеДокумента);

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.Физлицо,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента." + ПолеДатаДействия + " <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДанныеДокумента." + ПолеДатаДействия + "
	|		ИНАЧЕ ДанныеДокумента.ДатаДокумента
	|	КОНЕЦ КАК ДатаДействия,
	|	ДанныеДокумента." + ПолеПодразделение + " КАК Подразделение,
	|	ДанныеДокумента." + ПолеДолжность + " КАК Должность,
	|	ДанныеДокумента.ДатаДокумента
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	&ДанныеДокумента КАК ДанныеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Физлицо КАК Физлицо,
	|	ДанныеДокумента.ДатаДействия,
	|	МАКСИМУМ(Работники.Период) КАК Период
	|ПОМЕСТИТЬ РаботникиСрезПоследнихДаты
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|		ПО ДанныеДокумента.Физлицо = Работники.ФизЛицо
	|			И ДанныеДокумента.ДатаДействия >= Работники.Период
	|			И (&Ссылка <> Работники.Регистратор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Физлицо,
	|	ДанныеДокумента.ДатаДействия
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаботникиСрезПоследних.Физлицо КАК Физлицо,
	|	РаботникиСрезПоследних.ДатаДействия,
	|	РаботникиСрезПоследних.Период,
	|	Работники.Подразделение КАК Подразделение,
	|	Работники.Должность КАК Должность
	|ПОМЕСТИТЬ РаботникиСрезПоследних
	|ИЗ
	|	РегистрСведений.Работники КАК Работники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаботникиСрезПоследнихДаты КАК РаботникиСрезПоследних
	|		ПО Работники.ФизЛицо = РаботникиСрезПоследних.Физлицо
	|			И Работники.Период = РаботникиСрезПоследних.Период
	|			И (Работники.Регистратор <> &Ссылка)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ДанныеДокумента.Физлицо КАК Физлицо,
	|	ДанныеДокумента.ДатаДействия,
	|	ЕСТЬNULL(ДанныеДокумента.Подразделение, РаботникиСрезПоследних.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(ДанныеДокумента.Должность, РаботникиСрезПоследних.Должность) КАК Должность,
	|	РаботникиСрезПоследних.Подразделение КАК СтароеПодразделение,
	|	РаботникиСрезПоследних.Должность КАК СтараяДолжность
	|ПОМЕСТИТЬ ДанныеСотрудников
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаботникиСрезПоследних КАК РаботникиСрезПоследних
	|		ПО ДанныеДокумента.Физлицо = РаботникиСрезПоследних.Физлицо
	|
	|;
	|";
	Если ПолучатьПлановыеНачисления Тогда
		ТекстЗапроса = ТекстЗапроса +  
		"ВЫБРАТЬ
		|	УправленческиеНачисленияПоказатели.Ссылка КАК ВидРасчета,
		|	УправленческиеНачисленияПоказатели.НомерСтроки КАК НомерПоказателя,
		|	ВЫБОР
		|		КОГДА УправленческиеНачисленияПоказатели.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетВводаТарифногоРазряда
		|ПОМЕСТИТЬ ДанныеВидаРасчетаНачисления
		|ИЗ
		|	ПланВидовРасчета.УправленческиеНачисления.Показатели КАК УправленческиеНачисленияПоказатели
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.Сотрудник,
		|	ДанныеДокумента.Физлицо КАК Физлицо,
		|	ДанныеДокумента.ДатаДействия,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Начисления.ПериодЗавершения <= ДанныеДокумента.ДатаДействия
		|					И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА Начисления.ПериодЗавершения
		|			ИНАЧЕ Начисления.Период
		|		КОНЕЦ) КАК Период,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= ДанныеДокумента.ДатаДействия
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.ВидРасчетаЗавершения
		|		ИНАЧЕ Начисления.ВидРасчета
		|	КОНЕЦ КАК ВидРасчета
		|ПОМЕСТИТЬ НачисленияСрезПоследних
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботников КАК Начисления
		|		ПО ДанныеДокумента.Физлицо = Начисления.ФизЛицо
		|			И ДанныеДокумента.ДатаДействия >= Начисления.Период
		|ГДЕ
		|	Начисления.ВидРасчета ССЫЛКА ПланВидовРасчета.УправленческиеНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента.Сотрудник,
		|	ДанныеДокумента.Физлицо,
		|	ДанныеДокумента.ДатаДействия,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= ДанныеДокумента.ДатаДействия
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.ВидРасчетаЗавершения
		|		ИНАЧЕ Начисления.ВидРасчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокумента.Сотрудник,
		|	ДанныеДокумента.Физлицо КАК Физлицо,
		|	ДанныеДокумента.ДатаДействия,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Удержания.ПериодЗавершения <= ДанныеДокумента.ДатаДействия
		|					И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА Удержания.ПериодЗавершения
		|			ИНАЧЕ Удержания.Период
		|		КОНЕЦ) КАК Период,
		|	Удержания.ВидРасчета КАК ВидРасчета
		|ПОМЕСТИТЬ УдержанияСрезПоследних
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеУдержанияРаботников КАК Удержания
		|		ПО ДанныеДокумента.Физлицо = Удержания.ФизЛицо
		|			И ДанныеДокумента.ДатаДействия >= Удержания.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента.Сотрудник,
		|	ДанныеДокумента.Физлицо,
		|	ДанныеДокумента.ДатаДействия,
		|	Удержания.ВидРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияСрезПоследних.Сотрудник КАК Сотрудник,
		|	НачисленияСрезПоследних.Физлицо КАК Физлицо,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.ВидРасчетаЗавершения
		|		ИНАЧЕ Начисления.ВидРасчета
		|	КОНЕЦ КАК ВидРасчета,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета1.ТребуетВводаТарифногоРазряда
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.Показатель1Завершения
		|				ИНАЧЕ Начисления.Показатель1
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель1,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета2.ТребуетВводаТарифногоРазряда
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.Показатель2Завершения
		|				ИНАЧЕ Начисления.Показатель2
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель2,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета3.ТребуетВводаТарифногоРазряда
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.Показатель3Завершения
		|				ИНАЧЕ Начисления.Показатель3
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель3,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета4.ТребуетВводаТарифногоРазряда
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.Показатель4Завершения
		|				ИНАЧЕ Начисления.Показатель4
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель4,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета5.ТребуетВводаТарифногоРазряда
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.Показатель5Завершения
		|				ИНАЧЕ Начисления.Показатель5
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель5,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета6.ТребуетВводаТарифногоРазряда
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.Показатель6Завершения
		|				ИНАЧЕ Начисления.Показатель6
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель6,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета1.ТребуетВводаТарифногоРазряда
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|							И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА Начисления.ТарифныйРазряд1Завершения
		|					ИНАЧЕ Начисления.ТарифныйРазряд1
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|	КОНЕЦ КАК ТарифныйРазряд1,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета2.ТребуетВводаТарифногоРазряда
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|							И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА Начисления.ТарифныйРазряд2Завершения
		|					ИНАЧЕ Начисления.ТарифныйРазряд2
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|	КОНЕЦ КАК ТарифныйРазряд2,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета3.ТребуетВводаТарифногоРазряда
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|							И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА Начисления.ТарифныйРазряд3Завершения
		|					ИНАЧЕ Начисления.ТарифныйРазряд3
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|	КОНЕЦ КАК ТарифныйРазряд3,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета4.ТребуетВводаТарифногоРазряда
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|							И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА Начисления.ТарифныйРазряд4Завершения
		|					ИНАЧЕ Начисления.ТарифныйРазряд4
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|	КОНЕЦ КАК ТарифныйРазряд4,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета5.ТребуетВводаТарифногоРазряда
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|							И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА Начисления.ТарифныйРазряд5Завершения
		|					ИНАЧЕ Начисления.ТарифныйРазряд5
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|	КОНЕЦ КАК ТарифныйРазряд5,
		|	ВЫБОР
		|		КОГДА ДанныеВидаРасчета6.ТребуетВводаТарифногоРазряда
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|							И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА Начисления.ТарифныйРазряд6Завершения
		|					ИНАЧЕ Начисления.ТарифныйРазряд6
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|	КОНЕЦ КАК ТарифныйРазряд6,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта1Завершения
		|		ИНАЧЕ Начисления.Валюта1
		|	КОНЕЦ КАК Валюта1,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта2Завершения
		|		ИНАЧЕ Начисления.Валюта2
		|	КОНЕЦ КАК Валюта2,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта3Завершения
		|		ИНАЧЕ Начисления.Валюта3
		|	КОНЕЦ КАК Валюта3,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта4Завершения
		|		ИНАЧЕ Начисления.Валюта4
		|	КОНЕЦ КАК Валюта4,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта5Завершения
		|		ИНАЧЕ Начисления.Валюта5
		|	КОНЕЦ КАК Валюта5,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта6Завершения
		|		ИНАЧЕ Начисления.Валюта6
		|	КОНЕЦ КАК Валюта6,
		|	НачисленияСрезПоследних.ДатаДействия
		|ПОМЕСТИТЬ НачисленияСотрудника
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботников КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСрезПоследних КАК НачисленияСрезПоследних
		|		ПО (Начисления.Регистратор <> &Ссылка)
		|			И Начисления.ФизЛицо = НачисленияСрезПоследних.Физлицо
		|			И (ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.ПериодЗавершения = НачисленияСрезПоследних.Период
		|				ИНАЧЕ Начисления.Период = НачисленияСрезПоследних.Период
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.ВидРасчетаЗавершения = НачисленияСрезПоследних.ВидРасчета
		|				ИНАЧЕ Начисления.ВидРасчета = НачисленияСрезПоследних.ВидРасчета
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВидаРасчетаНачисления КАК ДанныеВидаРасчета1
		|		ПО (ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.ВидРасчетаЗавершения = ДанныеВидаРасчета1.ВидРасчета
		|				ИНАЧЕ Начисления.ВидРасчета = ДанныеВидаРасчета1.ВидРасчета
		|			КОНЕЦ)
		|			И (ДанныеВидаРасчета1.НомерПоказателя = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВидаРасчетаНачисления КАК ДанныеВидаРасчета2
		|		ПО (ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.ВидРасчетаЗавершения = ДанныеВидаРасчета2.ВидРасчета
		|				ИНАЧЕ Начисления.ВидРасчета = ДанныеВидаРасчета2.ВидРасчета
		|			КОНЕЦ)
		|			И (ДанныеВидаРасчета2.НомерПоказателя = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВидаРасчетаНачисления КАК ДанныеВидаРасчета3
		|		ПО (ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.ВидРасчетаЗавершения = ДанныеВидаРасчета3.ВидРасчета
		|				ИНАЧЕ Начисления.ВидРасчета = ДанныеВидаРасчета3.ВидРасчета
		|			КОНЕЦ)
		|			И (ДанныеВидаРасчета3.НомерПоказателя = 3)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВидаРасчетаНачисления КАК ДанныеВидаРасчета4
		|		ПО (ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.ВидРасчетаЗавершения = ДанныеВидаРасчета4.ВидРасчета
		|				ИНАЧЕ Начисления.ВидРасчета = ДанныеВидаРасчета4.ВидРасчета
		|			КОНЕЦ)
		|			И (ДанныеВидаРасчета4.НомерПоказателя = 4)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВидаРасчетаНачисления КАК ДанныеВидаРасчета5
		|		ПО (ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.ВидРасчетаЗавершения = ДанныеВидаРасчета5.ВидРасчета
		|				ИНАЧЕ Начисления.ВидРасчета = ДанныеВидаРасчета5.ВидРасчета
		|			КОНЕЦ)
		|			И (ДанныеВидаРасчета5.НомерПоказателя = 5)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеВидаРасчетаНачисления КАК ДанныеВидаРасчета6
		|		ПО (ВЫБОР
		|				КОГДА Начисления.ПериодЗавершения <= НачисленияСрезПоследних.ДатаДействия
		|						И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Начисления.ВидРасчетаЗавершения = ДанныеВидаРасчета6.ВидРасчета
		|				ИНАЧЕ Начисления.ВидРасчета = ДанныеВидаРасчета6.ВидРасчета
		|			КОНЕЦ)
		|			И (ДанныеВидаРасчета6.НомерПоказателя = 6)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	УдержанияСрезПоследних.Сотрудник,
		|	УдержанияСрезПоследних.Физлицо,
		|	Удержания.ВидРасчета,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Показатель1Завершения
		|		ИНАЧЕ Удержания.Показатель1
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Показатель2Завершения
		|		ИНАЧЕ Удержания.Показатель2
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Показатель3Завершения
		|		ИНАЧЕ Удержания.Показатель3
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Показатель4Завершения
		|		ИНАЧЕ Удержания.Показатель4
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Показатель5Завершения
		|		ИНАЧЕ Удержания.Показатель5
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Показатель6Завершения
		|		ИНАЧЕ Удержания.Показатель6
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка),
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Валюта1Завершения
		|		ИНАЧЕ Удержания.Валюта1
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Валюта2Завершения
		|		ИНАЧЕ Удержания.Валюта2
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Валюта3Завершения
		|		ИНАЧЕ Удержания.Валюта3
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Валюта4Завершения
		|		ИНАЧЕ Удержания.Валюта4
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Валюта5Завершения
		|		ИНАЧЕ Удержания.Валюта5
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|				И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Удержания.Валюта6Завершения
		|		ИНАЧЕ Удержания.Валюта6
		|	КОНЕЦ,
		|	УдержанияСрезПоследних.ДатаДействия
		|ИЗ
		|	РегистрСведений.ПлановыеУдержанияРаботников КАК Удержания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УдержанияСрезПоследних КАК УдержанияСрезПоследних
		|		ПО (Удержания.Регистратор <> &Ссылка)
		|			И Удержания.ФизЛицо = УдержанияСрезПоследних.Физлицо
		|			И (ВЫБОР
		|				КОГДА Удержания.ПериодЗавершения <= УдержанияСрезПоследних.ДатаДействия
		|						И Удержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА Удержания.ПериодЗавершения = УдержанияСрезПоследних.Период
		|				ИНАЧЕ Удержания.Период = УдержанияСрезПоследних.Период
		|			КОНЕЦ)
		|			И Удержания.ВидРасчета = УдержанияСрезПоследних.ВидРасчета
		|;
		|";
	Иначе
		
		// здесь определяем "пустышку", если не выполняется запрос к регистру плановых начислений
		ТекстЗапроса = ТекстЗапроса +  
		"////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	NULL КАК Сотрудник,
		|	NULL КАК Физлицо,
		|	NULL КАК ВидРасчета,
		|	NULL КАК Показатель1,
		|	NULL КАК Показатель2,
		|	NULL КАК Показатель3,
		|	NULL КАК Показатель4,
		|	NULL КАК Показатель5,
		|	NULL КАК Показатель6,
		|	NULL КАК ТарифныйРазряд1,
		|	NULL КАК ТарифныйРазряд2,
		|	NULL КАК ТарифныйРазряд3,
		|	NULL КАК ТарифныйРазряд4,
		|	NULL КАК ТарифныйРазряд5,
		|	NULL КАК ТарифныйРазряд6,
		|	NULL КАК Валюта1,
		|	NULL КАК Валюта2,
		|	NULL КАК Валюта3,
		|	NULL КАК Валюта4,
		|	NULL КАК Валюта5,
		|	NULL КАК Валюта6,
		|	NULL КАК ДатаДействия
		|ПОМЕСТИТЬ НачисленияСотрудника
		|ГДЕ
		|	ЛОЖЬ
		|;
		|";
		
	КонецЕсли;
	
	ЗаполнениеНачислениямиДополнительный.ДобавитьТаблицыВЗапросПолученияДействийСУправленческимиНачислениями(ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапроса +  "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияСотрудника.Сотрудник КАК Сотрудник,
	|	НачисленияСотрудника.Физлицо,
	|	НачисленияСотрудника.ВидРасчета КАК ВидРасчета
	|ПОМЕСТИТЬ НачисленияЕстьВоВсехНаборах
	|ИЗ
	|	НачисленияСотрудника КАК НачисленияСотрудника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ПО НачисленияСотрудника.Сотрудник = НачисленияСтаройПозицииСрезПоследних.Сотрудник
	|			И НачисленияСотрудника.ВидРасчета = НачисленияСтаройПозицииСрезПоследних.ВидРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСотрудника.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидРасчета
	|			И НачисленияСотрудника.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияСтаройПозицииСрезПоследних.Сотрудник КАК Сотрудник,
	|	НачисленияСтаройПозицииСрезПоследних.ВидРасчета КАК ВидРасчета,
	|	НачисленияСтаройПозицииСрезПоследних.ДатаДействия КАК ДатаДействия,
	|	НачисленияСтаройПозицииСрезПоследних.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ НачисленияПозицийОтличаютсяЗначениямиПоказателей
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидРасчета
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|			И (НачисленияСтаройПозицииСрезПоследних.Показатель1 <> НачисленияНовойПозицииСрезПоследних.Показатель1
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель2 <> НачисленияНовойПозицииСрезПоследних.Показатель2
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель3 <> НачисленияНовойПозицииСрезПоследних.Показатель3
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель4 <> НачисленияНовойПозицииСрезПоследних.Показатель4
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель5 <> НачисленияНовойПозицииСрезПоследних.Показатель5
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель6 <> НачисленияНовойПозицииСрезПоследних.Показатель6
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд1
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд2
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд3
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд4
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд5
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд6)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияСтаройПозицииСрезПоследних.Сотрудник КАК Сотрудник,
	|	НачисленияСтаройПозицииСрезПоследних.ВидРасчета КАК ВидРасчета,
	|	НачисленияСтаройПозицииСрезПоследних.ДатаДействия КАК ДатаДействия,
	|	НачисленияСтаройПозицииСрезПоследних.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ НачисленияОтличаютсяЗначениямиПоказателей
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидРасчета
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|			И (НачисленияСтаройПозицииСрезПоследних.Показатель1 <> НачисленияНовойПозицииСрезПоследних.Показатель1
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель2 <> НачисленияНовойПозицииСрезПоследних.Показатель2
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель3 <> НачисленияНовойПозицииСрезПоследних.Показатель3
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель4 <> НачисленияНовойПозицииСрезПоследних.Показатель4
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель5 <> НачисленияНовойПозицииСрезПоследних.Показатель5
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель6 <> НачисленияНовойПозицииСрезПоследних.Показатель6
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд1
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд2
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд3
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд4
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд5
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд6)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НачисленияСотрудника.Сотрудник,
	|	НачисленияСотрудника.ВидРасчета,
	|	НачисленияСотрудника.ДатаДействия,
	|	НачисленияСотрудника.Физлицо
	|ИЗ
	|	НачисленияСотрудника КАК НачисленияСотрудника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСотрудника.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидРасчета
	|			И НачисленияСотрудника.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|			И (НачисленияСотрудника.Показатель1 <> НачисленияНовойПозицииСрезПоследних.Показатель1
	|				ИЛИ НачисленияСотрудника.Показатель2 <> НачисленияНовойПозицииСрезПоследних.Показатель2
	|				ИЛИ НачисленияСотрудника.Показатель3 <> НачисленияНовойПозицииСрезПоследних.Показатель3
	|				ИЛИ НачисленияСотрудника.Показатель4 <> НачисленияНовойПозицииСрезПоследних.Показатель4
	|				ИЛИ НачисленияСотрудника.Показатель5 <> НачисленияНовойПозицииСрезПоследних.Показатель5
	|				ИЛИ НачисленияСотрудника.Показатель6 <> НачисленияНовойПозицииСрезПоследних.Показатель6
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд1 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд1
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд2 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд2
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд3 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд3
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд4 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд4
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд5 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд5
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд6 <> НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд6)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НачисленияСотрудника.Сотрудник,
	|	НачисленияСотрудника.ВидРасчета,
	|	НачисленияСотрудника.ДатаДействия,
	|	НачисленияСотрудника.Физлицо
	|ИЗ
	|	НачисленияСотрудника КАК НачисленияСотрудника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ПО НачисленияСотрудника.ВидРасчета = НачисленияСтаройПозицииСрезПоследних.ВидРасчета
	|			И НачисленияСотрудника.Сотрудник = НачисленияСтаройПозицииСрезПоследних.Сотрудник
	|			И (НачисленияСотрудника.Показатель1 <> НачисленияСтаройПозицииСрезПоследних.Показатель1
	|				ИЛИ НачисленияСотрудника.Показатель2 <> НачисленияСтаройПозицииСрезПоследних.Показатель2
	|				ИЛИ НачисленияСотрудника.Показатель3 <> НачисленияСтаройПозицииСрезПоследних.Показатель3
	|				ИЛИ НачисленияСотрудника.Показатель4 <> НачисленияСтаройПозицииСрезПоследних.Показатель4
	|				ИЛИ НачисленияСотрудника.Показатель5 <> НачисленияСтаройПозицииСрезПоследних.Показатель5
	|				ИЛИ НачисленияСотрудника.Показатель6 <> НачисленияСтаройПозицииСрезПоследних.Показатель6
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд1 <> НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд2 <> НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд3 <> НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд4 <> НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд5 <> НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5
	|				ИЛИ НачисленияСотрудника.ТарифныйРазряд6 <> НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие,
	|	НачисленияСотрудника.Сотрудник,
	|	НачисленияСотрудника.Физлицо,
	|	НачисленияСотрудника.ВидРасчета,
	|	НачисленияСотрудника.Показатель1,
	|	НачисленияСотрудника.Показатель2,
	|	НачисленияСотрудника.Показатель3,
	|	НачисленияСотрудника.Показатель4,
	|	НачисленияСотрудника.Показатель5,
	|	НачисленияСотрудника.Показатель6,
	|	НачисленияСотрудника.ТарифныйРазряд1,
	|	НачисленияСотрудника.ТарифныйРазряд2,
	|	НачисленияСотрудника.ТарифныйРазряд3,
	|	НачисленияСотрудника.ТарифныйРазряд4,
	|	НачисленияСотрудника.ТарифныйРазряд5,
	|	НачисленияСотрудника.ТарифныйРазряд6,
	|	НачисленияСотрудника.Валюта1,
	|	НачисленияСотрудника.Валюта2,
	|	НачисленияСотрудника.Валюта3,
	|	НачисленияСотрудника.Валюта4,
	|	НачисленияСотрудника.Валюта5,
	|	НачисленияСотрудника.Валюта6,
	|	НачисленияСотрудника.ДатаДействия
	|ПОМЕСТИТЬ Начисления
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидРасчета
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель1 = НачисленияНовойПозицииСрезПоследних.Показатель1
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель2 = НачисленияНовойПозицииСрезПоследних.Показатель2
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель3 = НачисленияНовойПозицииСрезПоследних.Показатель3
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель4 = НачисленияНовойПозицииСрезПоследних.Показатель4
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель5 = НачисленияНовойПозицииСрезПоследних.Показатель5
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель6 = НачисленияНовойПозицииСрезПоследних.Показатель6
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд1
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд2
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд3
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд4
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд5
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд6
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСотрудника КАК НачисленияСотрудника
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияСотрудника.ВидРасчета
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель1 = НачисленияСотрудника.Показатель1
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель2 = НачисленияСотрудника.Показатель2
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель3 = НачисленияСотрудника.Показатель3
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель4 = НачисленияСотрудника.Показатель4
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель5 = НачисленияСотрудника.Показатель5
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель6 = НачисленияСотрудника.Показатель6
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1 = НачисленияСотрудника.ТарифныйРазряд1
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2 = НачисленияСотрудника.ТарифныйРазряд2
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3 = НачисленияСотрудника.ТарифныйРазряд3
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4 = НачисленияСотрудника.ТарифныйРазряд4
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5 = НачисленияСотрудника.ТарифныйРазряд5
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6 = НачисленияСотрудника.ТарифныйРазряд6
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияСотрудника.Сотрудник
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять),
	|	НачисленияСотрудника.Сотрудник,
	|	НачисленияСотрудника.Физлицо,
	|	НачисленияСотрудника.ВидРасчета,
	|	НачисленияСотрудника.Показатель1,
	|	НачисленияСотрудника.Показатель2,
	|	НачисленияСотрудника.Показатель3,
	|	НачисленияСотрудника.Показатель4,
	|	НачисленияСотрудника.Показатель5,
	|	НачисленияСотрудника.Показатель6,
	|	НачисленияСотрудника.ТарифныйРазряд1,
	|	НачисленияСотрудника.ТарифныйРазряд2,
	|	НачисленияСотрудника.ТарифныйРазряд3,
	|	НачисленияСотрудника.ТарифныйРазряд4,
	|	НачисленияСотрудника.ТарифныйРазряд5,
	|	НачисленияСотрудника.ТарифныйРазряд6,
	|	НачисленияСотрудника.Валюта1,
	|	НачисленияСотрудника.Валюта2,
	|	НачисленияСотрудника.Валюта3,
	|	НачисленияСотрудника.Валюта4,
	|	НачисленияСотрудника.Валюта5,
	|	НачисленияСотрудника.Валюта6,
	|	НачисленияСотрудника.ДатаДействия
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидРасчета
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель1 = НачисленияНовойПозицииСрезПоследних.Показатель1
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель2 = НачисленияНовойПозицииСрезПоследних.Показатель2
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель3 = НачисленияНовойПозицииСрезПоследних.Показатель3
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель4 = НачисленияНовойПозицииСрезПоследних.Показатель4
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель5 = НачисленияНовойПозицииСрезПоследних.Показатель5
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель6 = НачисленияНовойПозицииСрезПоследних.Показатель6
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд1
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд2
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд3
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд4
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд5
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд6
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияСотрудника КАК НачисленияСотрудника
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияСотрудника.ВидРасчета
	|			И (НачисленияСтаройПозицииСрезПоследних.Показатель1 <> НачисленияСотрудника.Показатель1
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель2 <> НачисленияСотрудника.Показатель2
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель3 <> НачисленияСотрудника.Показатель3
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель4 <> НачисленияСотрудника.Показатель4
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель5 <> НачисленияСотрудника.Показатель5
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.Показатель6 <> НачисленияСотрудника.Показатель6
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1 <> НачисленияСотрудника.ТарифныйРазряд1
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2 <> НачисленияСотрудника.ТарифныйРазряд2
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3 <> НачисленияСотрудника.ТарифныйРазряд3
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4 <> НачисленияСотрудника.ТарифныйРазряд4
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5 <> НачисленияСотрудника.ТарифныйРазряд5
	|				ИЛИ НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6 <> НачисленияСотрудника.ТарифныйРазряд6)
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияСотрудника.Сотрудник
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать),
	|	ДанныеСотрудников.Сотрудник,
	|	ДанныеСотрудников.Физлицо,
	|	НачисленияНовойПозицииСрезПоследних.ВидРасчета,
	|	НачисленияНовойПозицииСрезПоследних.Показатель1,
	|	НачисленияНовойПозицииСрезПоследних.Показатель2,
	|	НачисленияНовойПозицииСрезПоследних.Показатель3,
	|	НачисленияНовойПозицииСрезПоследних.Показатель4,
	|	НачисленияНовойПозицииСрезПоследних.Показатель5,
	|	НачисленияНовойПозицииСрезПоследних.Показатель6,
	|	НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд1,
	|	НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд2,
	|	НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд3,
	|	НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд4,
	|	НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд5,
	|	НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд6,
	|	НачисленияНовойПозицииСрезПоследних.Валюта1,
	|	НачисленияНовойПозицииСрезПоследних.Валюта2,
	|	НачисленияНовойПозицииСрезПоследних.Валюта3,
	|	НачисленияНовойПозицииСрезПоследних.Валюта4,
	|	НачисленияНовойПозицииСрезПоследних.Валюта5,
	|	НачисленияНовойПозицииСрезПоследних.Валюта6,
	|	ДанныеСотрудников.ДатаДействия
	|ИЗ
	|	НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ПО (НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидРасчета)
	|			И НачисленияНовойПозицииСрезПоследних.Сотрудник = НачисленияСтаройПозицииСрезПоследних.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО НачисленияНовойПозицииСрезПоследних.Сотрудник = ДанныеСотрудников.Сотрудник
	|ГДЕ
	|	НачисленияСтаройПозицииСрезПоследних.ВидРасчета ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить),
	|	ДанныеСотрудников.Сотрудник,
	|	ДанныеСотрудников.Физлицо,
	|	НачисленияСтаройПозицииСрезПоследних.ВидРасчета,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель1,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель2,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель3,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель4,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель5,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель6,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта1,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта2,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта3,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта4,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта5,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта6,
	|	ДанныеСотрудников.ДатаДействия
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидРасчета
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО НачисленияСтаройПозицииСрезПоследних.Сотрудник = ДанныеСотрудников.Сотрудник
	|ГДЕ
	|	НачисленияНовойПозицииСрезПоследних.ВидРасчета ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать),
	|	ДанныеСотрудников.Сотрудник,
	|	ДанныеСотрудников.Физлицо,
	|	НачисленияСтаройПозицииСрезПоследних.ВидРасчета,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель1,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель2,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель3,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель4,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель5,
	|	НачисленияСтаройПозицииСрезПоследних.Показатель6,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5,
	|	НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта1,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта2,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта3,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта4,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта5,
	|	НачисленияСтаройПозицииСрезПоследних.Валюта6,
	|	ДанныеСотрудников.ДатаДействия
	|ИЗ
	|	НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидРасчета
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель1 = НачисленияНовойПозицииСрезПоследних.Показатель1
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель2 = НачисленияНовойПозицииСрезПоследних.Показатель2
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель3 = НачисленияНовойПозицииСрезПоследних.Показатель3
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель4 = НачисленияНовойПозицииСрезПоследних.Показатель4
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель5 = НачисленияНовойПозицииСрезПоследних.Показатель5
	|			И НачисленияСтаройПозицииСрезПоследних.Показатель6 = НачисленияНовойПозицииСрезПоследних.Показатель6
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд1 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд1
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд2 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд2
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд3 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд3
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд4 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд4
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд5 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд5
	|			И НачисленияСтаройПозицииСрезПоследних.ТарифныйРазряд6 = НачисленияНовойПозицииСрезПоследних.ТарифныйРазряд6
	|			И НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСотрудника КАК НачисленияСотрудника
	|		ПО НачисленияСтаройПозицииСрезПоследних.Сотрудник = НачисленияСотрудника.Сотрудник
	|			И НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияСотрудника.ВидРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО НачисленияСтаройПозицииСрезПоследних.Сотрудник = ДанныеСотрудников.Сотрудник
	|ГДЕ
	|	НачисленияСотрудника.ВидРасчета ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Изменить),
	|	НачисленияОтличаютсяЗначениямиПоказателей.Сотрудник,
	|	НачисленияОтличаютсяЗначениямиПоказателей.Физлицо,
	|	НачисленияОтличаютсяЗначениямиПоказателей.ВидРасчета,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	НачисленияОтличаютсяЗначениямиПоказателей.ДатаДействия
	|ИЗ
	|	НачисленияОтличаютсяЗначениямиПоказателей КАК НачисленияОтличаютсяЗначениямиПоказателей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияЕстьВоВсехНаборах КАК НачисленияЕстьВоВсехНаборах
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияПозицийОтличаютсяЗначениямиПоказателей КАК НачисленияПозицийОтличаютсяЗначениямиПоказателей
	|			ПО (НачисленияПозицийОтличаютсяЗначениямиПоказателей.Сотрудник = НачисленияЕстьВоВсехНаборах.Сотрудник)
	|				И (НачисленияПозицийОтличаютсяЗначениямиПоказателей.ВидРасчета = НачисленияЕстьВоВсехНаборах.ВидРасчета)
	|		ПО НачисленияОтличаютсяЗначениямиПоказателей.Сотрудник = НачисленияЕстьВоВсехНаборах.Сотрудник
	|			И НачисленияОтличаютсяЗначениямиПоказателей.ВидРасчета = НачисленияЕстьВоВсехНаборах.ВидРасчета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять),
	|	НачисленияСотрудника.Сотрудник,
	|	НачисленияСотрудника.Физлицо,
	|	НачисленияСотрудника.ВидРасчета,
	|	НачисленияСотрудника.Показатель1,
	|	НачисленияСотрудника.Показатель2,
	|	НачисленияСотрудника.Показатель3,
	|	НачисленияСотрудника.Показатель4,
	|	НачисленияСотрудника.Показатель5,
	|	НачисленияСотрудника.Показатель6,
	|	НачисленияСотрудника.ТарифныйРазряд1,
	|	НачисленияСотрудника.ТарифныйРазряд2,
	|	НачисленияСотрудника.ТарифныйРазряд3,
	|	НачисленияСотрудника.ТарифныйРазряд4,
	|	НачисленияСотрудника.ТарифныйРазряд5,
	|	НачисленияСотрудника.ТарифныйРазряд6,
	|	НачисленияСотрудника.Валюта1,
	|	НачисленияСотрудника.Валюта2,
	|	НачисленияСотрудника.Валюта3,
	|	НачисленияСотрудника.Валюта4,
	|	НачисленияСотрудника.Валюта5,
	|	НачисленияСотрудника.Валюта6,
	|	НачисленияСотрудника.ДатаДействия
	|ИЗ
	|	НачисленияСотрудника КАК НачисленияСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияНовойПозицииСрезПоследних КАК НачисленияНовойПозицииСрезПоследних
	|		ПО НачисленияСотрудника.ВидРасчета = НачисленияНовойПозицииСрезПоследних.ВидРасчета
	|			И НачисленияСотрудника.Сотрудник = НачисленияНовойПозицииСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияСтаройПозицииСрезПоследних КАК НачисленияСтаройПозицииСрезПоследних
	|		ПО (НачисленияСтаройПозицииСрезПоследних.ВидРасчета = НачисленияСотрудника.ВидРасчета)
	|			И НачисленияСотрудника.Сотрудник = НачисленияСтаройПозицииСрезПоследних.Сотрудник
	|ГДЕ
	|	НачисленияНовойПозицииСрезПоследних.ВидРасчета ЕСТЬ NULL 
	|	И НачисленияСтаройПозицииСрезПоследних.ВидРасчета ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Начисления.ВидРасчета ССЫЛКА ПланВидовРасчета.УправленческиеНачисления
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоНачисление,
	|	Начисления.Действие КАК Действие,
	|	Начисления.ДатаДействия,
	|	Начисления.Сотрудник,
	|	Начисления.Физлицо КАК Физлицо,
	|	Начисления.ВидРасчета,
	|	ЕСТЬNULL(Начисления.Показатель1, 0) КАК Показатель1,
	|	ЕСТЬNULL(Начисления.Показатель2, 0) КАК Показатель2,
	|	ЕСТЬNULL(Начисления.Показатель3, 0) КАК Показатель3,
	|	ЕСТЬNULL(Начисления.Показатель4, 0) КАК Показатель4,
	|	ЕСТЬNULL(Начисления.Показатель5, 0) КАК Показатель5,
	|	ЕСТЬNULL(Начисления.Показатель6, 0) КАК Показатель6,
	|	Начисления.ТарифныйРазряд1,
	|	Начисления.ТарифныйРазряд2,
	|	Начисления.ТарифныйРазряд3,
	|	Начисления.ТарифныйРазряд4,
	|	Начисления.ТарифныйРазряд5,
	|	Начисления.ТарифныйРазряд6,
	|	ЕСТЬNULL(Начисления.Валюта1, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта1,
	|	ЕСТЬNULL(Начисления.Валюта2, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта2,
	|	ЕСТЬNULL(Начисления.Валюта3, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта3,
	|	ЕСТЬNULL(Начисления.Валюта4, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта4,
	|	ЕСТЬNULL(Начисления.Валюта5, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта5,
	|	ЕСТЬNULL(Начисления.Валюта6, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта6
	|ИЗ
	|	Начисления КАК Начисления";
	
	// В оставшейся части запроса объединяются выборки, сформированные по следующим условиям:
	//	- часть 1: вид расчета есть в наборах старой и новой позиций, в "наборе сотруднике" (везде)
	//  и все записи равны по показателям - не изменять
	//	- часть 2: есть везде, в старой и новой позициях по показателям равны, в сотруднике 
	//  значения показателей отличаются	- не изменять
	//	- часть 3: есть в наборе новой позиции, но нет в наборе старой - начать
	//	- часть 4: есть в наборе старой позиции, но нет в наборе новой - прекратить
	//	- часть 5: есть в наборе старой позиции, есть в наборе новой, но нет в наборе сотрудника - начать
	//	- часть 6: есть в наборе старой, есть в наборе новой, есть в наборе сотрудника, 
	//	отличаются значения показателей - изменить (занулить показатели)
	//	- часть 7: все, чего нет ни в наборе старой ни в наборе новой позиций - не изменять
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
